<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<html>
  <head>
    <title>Tunne vihollisesi</title>
  </head>

  <body>
    <h2><i>Skriptipennun ty&ouml;kalut ja toimintatavat</i></h2>
    <h1>Tunne vihollisesi</h1>
    <a href="mailto:lance@spitzner.net">
      Lance Spitzner</a> kirjoitti alkuper&auml;isen tekstin
    <a href="http://www.enteract.com/%7elspitz/enemy.html">Know Your Enemy</a>
    15. helmikuuta 2000<br>

    <p>
      <b>Komentajani tapasi sanoa: "Voidaksesi suojautua viholliselta sinun
	pit&auml;&auml; ensin tiet&auml;&auml; kuka h&auml;n on." T&auml;m&auml; sotilaallinen doktriini
	soveltuu my&ouml;s verkkoturvallisuuden maailmaan. Aivan kuten
	sotilaallisessa toiminnassa sinulla on resursseja suojeltavana.
	Jotta voit suojata resurssisi sinun t&auml;ytyy tiet&auml;&auml; kuka on uhka, ja
	miten h&auml;n hy&ouml;kk&auml;&auml;. T&auml;m&auml; artikkeli, ensimm&auml;inen osa kolmiosaisesta
	sarjasta, auttaa t&auml;ss&auml;. Artikkeli k&auml;sittelee ty&ouml;kaluja ja
	toimintatapoja, joita er&auml;s yleisimmist&auml; ja universaaleimmista uhkista,
	<i>skriptipentu,</i> k&auml;ytt&auml;&auml;.
	<a href="http://www.enteract.com/%7elspitz/enemy2.html">Toinen osa</a>
	keskittyy
	murtoyritysten havaitsemiseen sek&auml; k&auml;ytettyjen ty&ouml;kalujen ja
	hy&ouml;kk&auml;&auml;j&auml;n etsimien heikkouksien tunnistamiseen.
	<a href="http://www.enteract.com/%7elspitz/enemy3.html">Kolmas osa</a>
	keskittyy siihen, mit&auml; tapahtuu kun
	hy&ouml;kk&auml;&auml;j&auml; saa p&auml;&auml;k&auml;ytt&auml;j&auml;n oikeudet. Erityisesti, miten h&auml;n peitt&auml;&auml;
	j&auml;lkens&auml; ja mit&auml; tekee sen j&auml;lkeen.
      </b>

    <h2>Kuka on skriptipentu</h2>

    <p>Skriptipentu etsii helppoa saalista. He eiv&auml;t yrit&auml; etsi&auml; mit&auml;&auml;n
      erityist&auml; tietoa tai pid&auml; maalinaan tietty&auml; yrityst&auml;. Heid&auml;n
      tavoitteensa on saada p&auml;&auml;k&auml;ytt&auml;j&auml;n oikeudet mahdollisimman v&auml;h&auml;ll&auml;
      vaivalla. T&auml;m&auml;n he tekev&auml;t keskittym&auml;ll&auml; pieneen m&auml;&auml;r&auml;&auml;n tunnettuja
      tietoturva-aukkoja, ja etsim&auml;ll&auml; n&auml;it&auml; aukkoja koko Internetist&auml;.
      Ennemmin tai my&ouml;hemmin he l&ouml;yt&auml;v&auml;t haavoittuvan kohteen.

    <p>Toiset heist&auml; ovat kehittyneempi&auml; k&auml;ytt&auml;ji&auml;, jotka suunnittelevat omat
      ty&ouml;kalunsa ja j&auml;tt&auml;v&auml;t j&auml;lkeens&auml; hienostuneita takaovia. Toisilla ei ole
      hajuakaan mit&auml; tekev&auml;t, kunhan osaavat vain kirjoittaa "go"
      komentokehoitteeseen. Taitotasostaan riippumatta heill&auml; kaikilla on
      yhteinen strategia: he etsiv&auml;t satunnaisesti tiettyj&auml; heikkouksia ja
      k&auml;ytt&auml;v&auml;t niit&auml; sitten hyv&auml;kseen.

    <h2>Uhka</h2>

    <p>Kohteiden satunnainen valinta tekee skriptipennuista vaarallisen uhkan.
      Ennemmin tai my&ouml;hemmin jokainen j&auml;rjestelm&auml; ja verkko skannataan,
      piiloutua
      ei voi. Tied&auml;n yll&auml;pit&auml;jist&auml;, joiden yll&auml;tykseksi heid&auml;n j&auml;rjestelm&auml;ns&auml;
      oli
      skannattu kahden p&auml;iv&auml;n sis&auml;ll&auml; k&auml;ynnist&auml;misest&auml;, vaikkei kukaan edes
      tiennyt
      niist&auml;. T&auml;ss&auml; ei ole kuitenkaan mit&auml;&auml;n &auml;llistytt&auml;v&auml;&auml;. Todenn&auml;k&ouml;isimmin
      heid&auml;n
      j&auml;rjestelmi&auml;&auml;n skannasi skriptipentu, joka sattui kokeilemaan sit&auml;
      verkkoaluetta.

    <p>Jos t&auml;m&auml; rajoittuisi useisiin yksitt&auml;isiin skannauksiin, tilastot
      olisivat
      meid&auml;n puolellamme. Todenn&auml;k&ouml;isimmin kukaan ei l&ouml;yt&auml;isi meit&auml; Internetin
      miljoonien j&auml;rjestelmien joukosta. T&auml;m&auml; ei kuitenkaan pid&auml; paikkaansa.
      Monet
      murtoty&ouml;kaluista ovat helppok&auml;ytt&ouml;isi&auml; ja laajalle levinneit&auml;, kuka
      tahansa
      pystyy niit&auml; k&auml;ytt&auml;m&auml;&auml;n. Nopeasti kasvava ihmisjoukko hankkii n&auml;it&auml;
      ty&ouml;kaluja
      h&auml;lytt&auml;v&auml;ll&auml; vauhdilla. Koska Internet ei tunne maantieteellisi&auml; rajoja,
      t&auml;m&auml;
      uhka on nopeasti levinnyt ymp&auml;ri maailman. Yht&auml;kki&auml; tilastot ovat
      k&auml;&auml;ntym&auml;ss&auml;
      meit&auml; vastaan. Kun niin monet Internetin k&auml;ytt&auml;j&auml;t k&auml;ytt&auml;v&auml;t n&auml;it&auml;
      ty&ouml;kaluja,
      kysymys ei en&auml;&auml; kuulu skannataanko koneemme, vaan milloin se tapahtuu.

    <p>T&auml;m&auml; on erinomainen esimerkki siit&auml;, miten ep&auml;m&auml;&auml;r&auml;isyyteen perustuva
      turvallisuus (security through obscurity) voi pett&auml;&auml;. Voit luulla, ett&auml;
      ellei
      kukaan tied&auml; j&auml;rjestelm&auml;st&auml;si, olet turvassa. Jotkut taas kuvittelevat,
      ett&auml;
      ellei heid&auml;n j&auml;rjestelm&auml;ss&auml;&auml;n ole mit&auml;&auml;n arvokasta, kukaan ei vaivaudu
      sit&auml;
      skannaamaankaan. Mutta skriptipennut tavoittelevat juuri n&auml;it&auml;
      suojaamattomia
      j&auml;rjestelmi&auml; joita on helppo k&auml;ytt&auml;&auml; hyv&auml;ksi, helppoja saaliita.

    <h2>Menetelm&auml;t</h2>

    <p>Skriptipentujen menetelm&auml;t ovat yksinkertaisia. Skannataan Internetti&auml;
      etsien tietty&auml; heikkoutta, ja kun se l&ouml;ytyy, hy&ouml;dynnet&auml;&auml;n sit&auml;. Useimmat
      heid&auml;n
      k&auml;ytt&auml;mist&auml;&auml;n ty&ouml;kaluista ovat automaattisia, ja vaativat vain v&auml;h&auml;n
      vuorovaikutusta. Ty&ouml;kalu k&auml;ynnistet&auml;&auml;n ja p&auml;ivien kuluttua palataan
      hakemaan
      tuloksia. Ty&ouml;kalut eiv&auml;t ole saman laisia, kuten eiv&auml;t
      tietoturva-aukotkaan.
      Kuitenkin useimmat ty&ouml;kalut k&auml;ytt&auml;v&auml;t samaa strategiaa. Ensin kehitet&auml;&auml;n
      tietokanta skannattavista IP-osoitteista, sitten niit&auml; skannataan etsien
      tietty&auml; heikkoutta.

    <p>Esimerkiksi, oletetaan ett&auml; k&auml;ytt&auml;j&auml;ll&auml; on ty&ouml;kalu jolla voisi
      v&auml;&auml;rink&auml;ytt&auml;&auml;
      imap-palvelua Linux-j&auml;rjestelmiss&auml;, esimerkiksi
      <a href="http://www.enteract.com/%7elspitz/imapd_exploit.txt">
	imapd_exploit.c
      </a>.
      Ensin h&auml;n hankkisi tietokannan skannattavista IP-osoitteista (eli
      j&auml;rjestelmist&auml;,
      jotka ovat k&auml;ynniss&auml; ja tavoitettavissa). Kun t&auml;m&auml; IP-tietokanta on
      rakennettu, k&auml;ytt&auml;j&auml;
      haluaisi ottaa selville miss&auml; j&auml;rjestelmiss&auml; ajetaan Linuxia. Monet
      nykyiset
      skannerit kykenev&auml;t selvitt&auml;m&auml;&auml;n t&auml;m&auml;n helposti l&auml;hett&auml;m&auml;ll&auml; virheellisi&auml;
      paketteja kohdej&auml;rjestelm&auml;lle ja tutkien vastausta, esimerkiksi Fyodorin
      <a href="http://www.insecure.com/nmap">nmap</a>. Seuraavaksi h&auml;n
      k&auml;ytt&auml;isi
      sopivia ty&ouml;kaluja selvitt&auml;&auml;kseen mitk&auml; Linux-j&auml;rjestelmist&auml; ajavat
      imap-palvelua. En&auml;&auml; j&auml;ljell&auml; olisikin vain haavoittuviksi tiedettyjen
      j&auml;rjestelmien v&auml;&auml;rink&auml;ytt&auml;minen.

    <p>Voisi luulla, ett&auml; kaikki t&auml;m&auml; skannaaminen olisi &auml;&auml;rimm&auml;isen &auml;&auml;nek&auml;st&auml;
      ja her&auml;tt&auml;isi paljon huomiota. Kuitenkaan monet eiv&auml;t tarkkaile
      j&auml;rjestelmi&auml;&auml;n,
      eiv&auml;tk&auml; siten tajua joutuvansa skannatuksi. Lis&auml;ksi monet skriptipennut
      etsiv&auml;t
      kaikessa hiljaisuudessa yksitt&auml;isen j&auml;rjestelm&auml;n jonka voivat murtaa, ja
      t&auml;m&auml;n
      j&auml;lkeen k&auml;ytt&auml;v&auml;t sit&auml; laukaisualustana. T&auml;&auml;lt&auml; he voivat r&ouml;yhke&auml;sti
      skannata
      koko Internetti&auml; pelk&auml;&auml;m&auml;tt&auml; rangaistusta. Jos heid&auml;n skannauksensa
      havaitaan,
      syy menee j&auml;rjestelm&auml;n yll&auml;pit&auml;j&auml;n niskoille.

    <p>Lis&auml;ksi skannauksen tuloksia usein arkistoidaan tai jaetaan muiden
      k&auml;ytt&auml;jien kanssa ja k&auml;ytet&auml;&auml;n my&ouml;hemmin. Esimerkiksi, k&auml;ytt&auml;j&auml; kehitt&auml;&auml;
      tietokannan avoimista porteista saavutettavissa olevissa
      Linux-j&auml;rjestelmiss&auml;.
      H&auml;n rakensi tietokannan k&auml;ytt&auml;&auml;kseen hyv&auml;kseen tunnettua imap-palvelun
      aukkoa. Oletetaan ett&auml; vaikkapa kuukauden p&auml;&auml;st&auml; havaitaan uusi aukko
      jossain
      toisessa portissa. Sen sijaan, ett&auml; h&auml;n joutuisi rakentamaan uuden
      tietokannan
      (joka on aikaa vievin vaihe), k&auml;ytt&auml;j&auml; voi nopeasti k&auml;yd&auml; l&auml;pi
      arkistoimansa
      tietokannan ja murtaa haavoittuvat j&auml;rjestelm&auml;t. Skriptipennut my&ouml;s
      jakavat
      tai jopa myyv&auml;t haavoittuvien j&auml;rjestelmien tietokantoja toisilleen. N&auml;in
      skriptipentu voi murtaa j&auml;rjestelm&auml;n edes skannaamatta sit&auml; itse. Vaikka
      j&auml;rjestelmi&auml;si ei olisikaan viime aikoina skannattu, ei se tarkoita ett&auml;
      olisit turvassa.

    <p>Kehittyneemm&auml;t murtautujat luovat j&auml;rjestelm&auml;&auml;n troijalaisia ja takaovia
      sen murrettuaan. Takaovet p&auml;&auml;st&auml;v&auml;t k&auml;ytt&auml;j&auml;n helposti ja huomaamatta
      j&auml;rjestelm&auml;&auml;n milloin tahansa h&auml;n haluaa. Troijalaiset taas tekev&auml;t
      tunkeutujasta huomaamattoman. H&auml;n ei n&auml;y miss&auml;&auml;n lokeissa, j&auml;rjestelm&auml;n
      prosesseissa tai tiedostoj&auml;rjestelm&auml;ss&auml;. H&auml;n rakentaa itselleen mukavan
      ja turvallisen kodin josta voi h&auml;rskisti skannailla Internetti&auml;. Lis&auml;&auml;
      tietoja
      osassa <a href="http://www.enteract.com/%7elspitz/enemy3.html">
	Tunne vihollisesi: III
      </a>.

    <p>Hy&ouml;kk&auml;ykset eiv&auml;t rajoitu mihink&auml;&auml;n erityiseen aikaan p&auml;iv&auml;st&auml;. Monet
      yll&auml;pit&auml;j&auml;t etsiv&auml;t lokeistaan y&ouml;aikaan tapahtuvia yhteyksi&auml;, uskoen ett&auml;
      murtautujat iskev&auml;t silloin. Kuitenkin skriptipennut voivat iske&auml; mihin
      aikaan
      tahansa. Kun he skannaavat 24 tuntia p&auml;iv&auml;ss&auml;, ei voi tiet&auml;&auml; milloin
      tunnustelu tapahtuu. Sit&auml; paitsi n&auml;it&auml; hy&ouml;kk&auml;yksi&auml; suoritetaan ymp&auml;ri
      maailmaa.
      Kuten Internet ei tunne maantieteellisi&auml; rajoja, ei skannaaminenkaan
      tunne
      aikavy&ouml;hykkeit&auml;. Murtautujan olinpaikassa saattaa olla keskiy&ouml;, mutta
      meill&auml;
      kello yksi iltap&auml;iv&auml;ll&auml;.

    <p>Haavoittuvien porttien skannaamisen menetelm&auml;&auml; voidaan k&auml;ytt&auml;&auml; moniin
      eri tarkoituksiin. Viime aikoina on raportoitu uusia palvelun
      tukkimiseen perustuvia (Denial of Service) hy&ouml;kk&auml;yksi&auml;, tarkemmin ottaen
      hajautettuja sellaisia (DDoS, Distributed Denial of Service). N&auml;m&auml;
      hy&ouml;kk&auml;ykset perustuvat siihen, ett&auml; yksi k&auml;ytt&auml;j&auml; kontrolloi satoja,
      ellei tuhansia murrettuja j&auml;rjestelmi&auml; ymp&auml;ri maailmaa. N&auml;it&auml; murrettuja
      j&auml;rjestelmi&auml; sitten k&auml;ytet&auml;&auml;n DoS-hy&ouml;kk&auml;yksiin yht&auml; tai useampaa uhria
      kohtaan. Koska k&auml;ytet&auml;&auml;n monia murrettuja j&auml;rjestelmi&auml;, on eritt&auml;in
      vaikeaa puolustautua tai l&ouml;yt&auml;&auml; hy&ouml;kk&auml;yksen kohde. Usein k&auml;ytet&auml;&auml;n
      skriptipentujen keinoja, ett&auml; saadaan n&auml;in paljon j&auml;rjestelmi&auml;
      hallintaan. Ensin etsit&auml;&auml;n satunnaisesti haavoittuvia j&auml;rjestelmi&auml;,
      ja sitten murretaan ne k&auml;ytett&auml;v&auml;ksi DDoS-hy&ouml;kk&auml;yksen laukaisualustoina.
      Mit&auml; enemm&auml;n j&auml;rjestelmi&auml; on murrettu, sit&auml; voimakkaampi hy&ouml;kk&auml;ys
      saadaan aikaan. Esimerkki t&auml;llaisesta hy&ouml;kk&auml;yksest&auml; on
      '<a href="http://www.enteract.com/%7elspitz/ddos.txt">
	stacheldraht
      </a>'. Lis&auml;tietoja hajautetuista DoS-hy&ouml;kk&auml;yksist&auml; ja niilt&auml;
      suojautumisesta saat Paul Fergusonin sivustolta
      <a href="http://www.denialinfo.com/">Denialinfo</a>.

    <h2>Ty&ouml;kalut</h2>
    
    <p>K&auml;ytetyt ty&ouml;kalut ovat &auml;&auml;rimm&auml;isen helppok&auml;ytt&ouml;isi&auml;. Useimmat on tehty
      suorittamaan vain yht&auml; teht&auml;v&auml;&auml;, eik&auml; niiden toiminnassa ole paljoa
      vaihtoehtoja. Ensimm&auml;isill&auml; ty&ouml;kaluilla rakennetaan IP-tietokanta.
      N&auml;m&auml; toimivat puhtaan satunnaisesti, ja skannaavat Internetti&auml; mit&auml;&auml;n
      erottelematta. Esimerkiksi, er&auml;&auml;n ty&ouml;kalun k&auml;yt&ouml;ss&auml; on yksi parametri,
      vaihtoehtoina A, B tai C. Valittu kirjain m&auml;&auml;r&auml;&auml; skannattavan verkon
      koon. Ohjelma sitten valitsee satunnaisesti mit&auml; valitun kokoista verkkoa
      skannaa. Toinen vastaava taas k&auml;ytt&auml;&auml; domainin nime&auml; (z0ne on erinomainen
      esimerkki). Ty&ouml;kalu rakentaa IP-tietokannan suorittamalla aluekyselyit&auml;
      valitusta domain-nimest&auml; ja kaikista alidomaineista. K&auml;ytt&auml;j&auml;t ovat
      rakentaneet yli kahden miljoonan IP:n tietokantoja skannaamalla koko
      .com- tai .edu-domainia.

    <p>Kun osoitteet on n&auml;in saatu, niit&auml; skannataan toisenlaisilla
      ty&ouml;kaluohjelmilla tarkoituksena l&ouml;yt&auml;&auml; heikkouksia esimerkiksi
      tutkimalla named:in versiota, k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml; tai j&auml;rjestelm&auml;ss&auml;
      ajettavia palveluita. Kun haavoittuvat j&auml;rjestelm&auml;t on l&ouml;ydetty,
      murtautuja iskee. On olemassa useita ty&ouml;kaluja jotka yhdist&auml;v&auml;t kaikki
      n&auml;m&auml; ominaisuudet yhteen, kuten jsbachin
      <a href="http://www.ben2.ucla.edu/%7ejsbach/">sscan</a> tai
      <a href="http://www.enteract.com/%7elspitz/README.cracker.txt">
	cracker.pl
      </a>. Lis&auml;&auml; n&auml;iden ty&ouml;kalujen k&auml;yt&ouml;st&auml; kerrotaan osassa
      <a href="http://www.enteract.com/%7elspitz/enemy2.html">
	Tunne vihollisesi: II
      </a>.

    <h2>Kuinka suojautua</h2>

    <p>On olemassa keinoja, joilla suojautua t&auml;t&auml; uhkaa vastaan. Ensinn&auml;kin,
      skriptipentu tavoittelee helppoa saalista ja etsii yleisi&auml; tunnettuja
      turva-aukkoja. Varmista, etteiv&auml;t j&auml;rjestelm&auml;si ja verkkosi ole
      haavoittuvaisia n&auml;ilt&auml; osin. <a href="http://www.cert.org/">
	www.cert.org</a> ja <a href="http://www.ciac.org/">www.ciac.org</a>
      ovat erinomaisia tiedonl&auml;hteit&auml; tunnetuista tietoturva-aukoista. Lis&auml;ksi
      postilista
      <a href="http://www.securityfocus.com/forums/bugtraq/faq.html">
	bugtraq</a> (arkisto osoitteessa
      <a href="http://www.securityfocus.com/">www.securityfocus.com</a>) on
      er&auml;s parhaista tiedonl&auml;hteist&auml;.

    <p>Toinen tapa suojautua on ajaa pelk&auml;st&auml;&auml;n niit&auml; palveluita, joita todella
      tarvitset. Ellet tarvitse jotain palvelua, poista se. Jos palvelua
      tarvitaan, pid&auml; huoli ett&auml; se on tuorein versio. Jos haluat esimerkkej&auml;,
      katso <a href="http://www.enteract.com/%7elspitz/armoring.html">
	Armoring Solaris</a>,
      <a href="http://www.enteract.com/%7elspitz/linux.html">Armoring Linux</a>
      tai <a href="http://www.enteract.com/%7elspitz/nt.html">Armoring NT</a>.

    <p>Kuten Ty&ouml;kalut-osassa kerrottiin, DNS-palvelimia k&auml;ytet&auml;&auml;n usein
      hankittaessa tietokantaa skannattavista j&auml;rjestelmist&auml;. Rajoita
      j&auml;rjestelmi&auml;, joista voidaan tehd&auml; aluesiirtoja nimipalvelimiltasi.
      Ker&auml;&auml; kaikki luvattomat yritykset lokiin ja seuraa niit&auml;. Suosittelen
      p&auml;ivitt&auml;m&auml;&auml;n uusimpaan BINDin (DNS-palvelinohjelma) versioon, jonka
      l&ouml;yd&auml;t osoitteesta <a href="http://www,isc.org/bind.html">
	www.isc.org/bind.html</a>.

    <p>Lopuksi, tarkkaile j&auml;rjestelmi&auml;si tunnustelujen varalta. Kun havaitset
      sellaisia, voit j&auml;ljitt&auml;&auml; yrityksi&auml; ja ymm&auml;rt&auml;&auml; paremmin verkkoosi
      kohdistuvia uhkia, sek&auml; reagoida n&auml;ihin uhkiin.

    <h2>Johtop&auml;&auml;t&ouml;s</h2>

    <p>Skriptipennut uhkaavat kaikkia j&auml;rjestelmi&auml;. He skannaavat kaikkia
      j&auml;rjestelmi&auml;, riippumatta niiden sijannista tai arvosta. Ennemmin tai
      my&ouml;hemmin sinunkin j&auml;rjestelm&auml;&auml;si koetellaan. Ymm&auml;rt&auml;m&auml;ll&auml; heid&auml;n
      motiivinsa ja menetelm&auml;ns&auml; voit suojata j&auml;rjestelm&auml;si paremmin t&auml;t&auml; uhkaa
      vastaan.

    <p>
      <b>HUOM:</b> Kiitokset Brad Powellille Sunin Security Teamissa h&auml;nen
      avustaan t&auml;t&auml; artikkelia kirjoitettaessa

    <hr>

    <i>
    <p><b>Kirjoittaja</b><br>
      Lance Spitzner nauttii asioiden opettelusta tuhoilemalla kotonaan
      Unix-j&auml;rjestelmi&auml;. T&auml;t&auml; ennen h&auml;n oli
      <a href="http://www.enteract.com/%7elspitz/officer.html">
	valmiusjoukkojen upseeri</a>, miss&auml; teht&auml;v&auml;ss&auml; h&auml;n tuhosi hieman
      eri laatuisia asioita. H&auml;net voi tavoittaa s&auml;hk&ouml;postiosoitteesta
      <a href="mailto:lance@spitzner.net">lance@spitzner.net</a>.

    <p><b>Suomentaja</b><br>
      Antti Sinisalo <a href="mailto:aesinis@cc.jyu.fi">aesinis@cc.jyu.fi</a>
    </i>
      <br>
    <hr>

<!-- Created: Sun Mar 12 20:03:49 EET 2000 -->
<!-- hhmts start -->
Last modified: Mon Mar 13 01:39:20 EET 2000
<!-- hhmts end -->
  </body>
</html>

